ch6/rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "movies" SET "description" = 'An aspiring author during the civil rights movement of the 1960s decides to write a book detailing the African-American maids'' point of view on the white families for which they work, and the hardships they go through on a daily basis.', "updated_at" = '2015-08-13 16:51:05.136579' WHERE "movies"."id" = 6
---
	def update
		@movie = Movie.find params[:id]
		if @movie.update_attributes(params[:movie])