ch7/rottenpotatoes/app/controllers/movies_controller.rb

INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		@movie = Movie.new(params[:movie])
		if @movie.save